[{"label": "1", "title": "Introduction", "text": "Vehicular autonomy is transitioning from a vague and uncertain concept to an increasingly achievable and tangible mobility solution. With the advance of autonomous driving systems (ADS), the credibility of autonomous vehicle (AV) is growing dramatically (Bimbraw, 2015). Nevertheless, while there is a widespread acknowledgment that AVs hold the potential to enhance traffic efficiency, travel experience, and road safety (Van Brummelen et al., 2018), their current and near-future adoption is hindered by limited public acceptance, primarily driven by safety concerns. This challenge remains one of the most formidable obstacles to the large-scale implementation of AV technology (Yuen et al., 2020). Whether or not to introduce AVs raises profound questions on trust between human and machine, as well as the necessity of allowing manual interventions at high-automation levels (i.e., Levels 4 and 5 autonomies as defined in SAE International, 2018) (Waldrop, 2015; Baruch, 2016). Research has shown that trust in vehicular autonomy can be polarized and heterogeneous among individuals (Adnan et al., 2018). For example, people might be willing to accept and use AVs but still have intense interventions during certain unsafe scenarios (see in Bigman and Gray, 2020; Xu et al., 2022b; Zou et al., 2022). As suggested by previous studies (Choi and Ji, 2015; Herrenkind et al., 2019; Bernhard et al., 2020; Keszey, 2020), the public is more likely to accept the AVs and users are more presumably to relax during ADS operation if technical components were transparent and human-oriented, and the situational management (e.g., decision-making by ADS) was made understandable and operation-straightforward to the users. In other words, a comprehensible ADS (e.g., to conduct the dynamic driving tasks (DDT) under various conditions) and a comprehensive operational design domain (ODD) (i.e., domains that contain all kinds of supportive equipment for the proper ADS operation) will be vitally important for user adoption. User adoption of AVs has been well-studied over the last decade, and there were a large number of case studies carried out from both theoretical and empirical aspects. Insights on users’ adoption were mostly collected from surveys. For example, Madigan et al. (2017) conducted a questionnaire survey with 57 items (i.e., UTAUT survey) and collected the attitudes toward automated road transport systems from 315 participants. They concluded that the possibility of relaxing during the drive is weighted more important than the merits of AV functionality. Panagiotopoulos and Dimitrakopoulos (2018) carried out another survey on consumers’ intentions and expectations to accept AVs. Based on an empirical study conducted with an extensive sample size, respondents exhibited hesitance towards adopting autonomous vehicles, primarily driven by concerns regarding safety and human-vehicle interactions. Zhang et al. (2020) collected data from 647 drivers in China and concluded from this sample that user acceptance is mainly governed by social influence and initial trust. Kaye et al. (2020) analyzed people’s willingness to have an AV based on the responses of 1563 participants from Australia, France, and Sweden. Their results reflected differences between countries regarding the intention of using high-level AVs. These survey-based studies collected valuable opinions from general public towards AVs; nevertheless, the analysis was based on a classic stated-preference techniques and in literature there is a common belief that this type of studies may fall short due to sample selection bias, access issues, and integrity issues (Wright, 2005). To this end, it appears that experience-based data collection is required to gain insights into user opinion towards AV acceptance in general, as well as the safety perception towards AVs, whether or not to intervene in ADS operations, etc. Though studies of AV adoption concerning user experience were not extensive in literature, recent research did move in this direction. Some empirical studies using simulation-aided approaches were carried out to understand user acceptance from the individual perspective (see for example Zou et al., 2021; Ma et al., 2020; Weschke et al., 2021; Yu et al., 2021). Particularly, Zou et al. (2021) studied user perception towards high-level ADS and concluded that the appreciation of AV technology depends on whether the ADS delivers a human-driver-resembled form. Using a similar approach, Weschke et al. (2021) further validated that the propensity to use AVs increases with experience. Furthermore, Yu et al. (2021) assessed the level of trust on advanced driver assistance systems (ADAS) using hand positions during vehicle operation as an indication. Their results suggested that people are more willing to trust ADS which is well-developed and safe. It has been pointed out by recent research that “trust” stands out as the most significant contributing factor to user adoption; in particular, the features of so-called “critical scenarios” are of high research attention (Zhang et al., 2021). Research questions, such as “what are the critical scenarios perceived by AVs?” and “in which way should an AV response to such scenarios?” are well discussed in recent literature (see for example Hallerbach et al., 2018; Feng et al., 2020; Kuutti et al., 2020). Hallerbach et al. (2018) proposed a simulation-based toolchain for the identification of critical scenarios during AV operation. Feng et al. (2020) proposed a criticality measure that combines encountered manoeuvre challenges and exposure frequency. Kuutti et al. (2020) stressed that safety validation in AV-related studies is mainly due to limitations in using study tools and a lack of clear definitions of scenarios (e.g., failures in the connection between ADS and ODD). Furthermore, it has been recognized that there exist theory–practice gaps where user adoption might be underestimated (Ko and Fink, 2010). In general, most mainstream ADS algorithms are technical-oriented, and the experiments focused on the performance of the employed algorithms (i.e., driven by advanced artificial intelligence) under crucial circumstances (e.g., to reduce or even eliminate potential traffic conflicts). While the objective is legitimate and sound, these algorithms depend on situational contexts which are not readily accepted by the public. This was reflected by Li et al. (2019) utilizing an augmented virtual reality simulation experiment, and by Feng et al. (2021a) utilizing a naturalistic and adversarial driving experiment, respectively. On the other hand, behavioral studies were often carried out under controlled and simplified circumstances, which provided valuable empirical experience but were isolated from situational contexts (see example studies by Zou et al., 2021; Weschke et al., 2021). Several recent works discussed the “behavioral difference” between AI-driven ADS and human drivers to further reveal potential factors contributing to user acceptance. Cascetta et al. (2022) quantified and tested the “humanity” of automated cars (equivalent to Level.2 autonomy) and suggested that the driver’s interaction could be reduced under high “humanity” mode (i.e., driving like human drivers). Xu et al., (2022b) demonstrated, via experiments, the inconsistency in driving patterns between high-level automation (equivalent to Level 4 autonomy) and human drivers, and pointed out that there exists a significant difference in hazard perception, which was the leading cause of the reflected inconsistency. However, many of the aforementioned findings were derived from studies carried out in controlled on-road conditions or from simulations that lack full accuracy. In these settings, both traffic and environmental factors are frequently simplified, failing to capture the complexity of naturalistic driving conditions encountered in real-world scenarios. Motivated by previous studies, this work made step-forward efforts to understand the features of critical scenarios during autonomous driving, offering insights into the cause of human intervention and the difference in situational reactions between ADS and human drivers. Specifically, we undertook a systematic examination of safety–critical events from the perspective of Level 4 ADS, covering an extensive array of scenarios. To accomplish this, we employed an advanced, AV-supported, microsimulation-integrated, and VR-enabled simulation platform. In a subsequent step, we conducted empirical experiments involving human participants on this same platform to cross-validate the safety–critical events as identified by the ADS, thereby providing a holistic assessment of autonomous vehicle safety. The platform is entirely tractable and transparentizes the ADS operational mechanism. Utilizing the obtained data, we examined riders’ behavioral adaptations while interacting with the high-level ADS during DDTs under various circumstances. Furthermore, the difference in perception of scenario criticality between ADS and human riders was identified and analyzed. The derived knowledge from this research will illuminate both the technical and social challenges associated with user acceptance of ADS (Adnan et al., 2018), providing valuable guidance for overcoming these obstacles. Fundamentally, this work addressed research questions including:\n                        \n                           •\n                           What characteristics contribute to critical scenarios during high-level ADS operation?\n                        \n                        \n                           •\n                           Whether such scenarios present the same challenges to both ADS and human riders?\n                        \n                        \n                           •\n                           What factors influence human trustworthiness during DDTs?\n                        \n                     \n                   The remainder of this paper is organized as follows. Section 2 outlines the analytical framework, which is followed by an examination of scenario criticality and the design for human-involved experiments in Section 3. Comparative results and associated analyses are presented in Section 4. Key findings are summarized and discussed in Section 5, with the conclusion provided in Section 6.", "subsections": []}, {"label": "2", "title": "Analytic framework", "text": "This section presents the analytic framework of the proposed reserach. Sub-section 2.1 outlines the terminologies and variables utilized, in particular it gives the definition of “criticality” which is to be measured and discussed. Sub-section 2.2 explains the statistical model that quantifies the criticality of the different scenarios during ADS operation. Sub-section 2.3 provides details in relation to the development of the simulation environment.", "subsections": [{"label": "2.1", "title": "Definitions and terminologies", "text": "To define the term “criticality”, this study adopted the terminologies for ADS testing from the work of Ulbrich et al. (2015) to establish the context. First, a “scene” denotes normal driving environments, including static elements (e.g., sceneries), dynamic elements (e.g., weather and lighting), operational driving instructions (e.g., defined movable areas), etc. For example, a scene features certain road geometric designs, lane characteristics, terrain and surface conditions, weather conditions, etc. Then, “scenario” denotes the temporal development in a sequence of scenes. An AV can generally perform various dynamic driving tasks (DDTs) under specific scenarios. Specified traffic movements, traffic rules, supportive equipment, etc. might be involved in a scenario as a result of a sequence of scenes. Finally, a “situation” denotes a situational context that corresponds to a specific scenario; in particular, it refers to operational interruptions under certain circumstances due to vehicle–pedestrian, vehicle-vehicle, vehicle-bicycle, or vehicle-infrastructure interactions. Fig. 1\n                         provides a visual representation of essential elements involved in this work. Mathematically, the testing “scenes” for ADS operation can be expressed as:\n                           \n                              (1)\n                              \n                                 \n                                    X\n                                    =\n                                    \n                                       \n                                          \n                                             \n                                                \n                                                   \n                                                      \n                                                         \n                                                            \n                                                               \n                                                                  \n                                                                     \n                                                                        \n                                                                           R\n                                                                           1\n                                                                        \n                                                                        ,\n                                                                        \n                                                                           R\n                                                                           2\n                                                                        \n                                                                        ,\n                                                                        ⋯\n                                                                        ,\n                                                                        \n                                                                           R\n                                                                           i\n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                               \n                                                                  \n                                                                     \n                                                                        \n                                                                           L\n                                                                           1\n                                                                        \n                                                                        ,\n                                                                        \n                                                                           L\n                                                                           2\n                                                                        \n                                                                        ,\n                                                                        ⋯\n                                                                        ,\n                                                                        \n                                                                           L\n                                                                           i\n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                               \n                                                                  \n                                                                     \n                                                                        \n                                                                           W\n                                                                           1\n                                                                        \n                                                                        ,\n                                                                        \n                                                                           W\n                                                                           2\n                                                                        \n                                                                        ,\n                                                                        ⋯\n                                                                        ,\n                                                                        \n                                                                           W\n                                                                           i\n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                               \n                                                                  \n                                                                     \n                                                                        ⋮\n                                                                        ⋮\n                                                                        ⋮\n                                                                     \n                                                                  \n                                                               \n                                                            \n                                                         \n                                                      \n                                                   \n                                                   \n                                                      \n                                                         \n                                                            \n                                                               P\n                                                               1\n                                                            \n                                                            ,\n                                                            \n                                                               P\n                                                               2\n                                                            \n                                                            ,\n                                                            ⋯\n                                                            ,\n                                                            \n                                                               P\n                                                               i\n                                                            \n                                                         \n                                                      \n                                                   \n                                                \n                                             \n                                          \n                                       \n                                    \n                                    ,\n                                    O\n                                    D\n                                    D\n                                    ∈\n                                    X\n                                 \n                              \n                           \n                        \n                      where \n                           \n                              R\n                           \n                        , \n                           \n                              L\n                           \n                        , \n                           \n                              W\n                           \n                        , and \n                           \n                              P\n                           \n                         denote road type, lane number, weather condition, and plant condition, respectively. Note that the \n                           \n                              X\n                           \n                         includes a vast number of combinations, but not every single scene is entirely supportive for AV’s operation (e.g., road segments without sensing systems). Thus, we mention that ODD \n                           \n                              ∈\n                              X\n                           \n                        . With regard to the “scenarios”, it can be written as below containing both static and dynamic elements:\n                           \n                              (2)\n                              \n                                 \n                                    \n                                       φ\n                                       i\n                                    \n                                    =\n                                    \n                                       \n                                          \n                                             \n                                                \n                                                   \n                                                      \n                                                         \n                                                            \n                                                               \n                                                                  \n                                                                     \n                                                                        \n                                                                           \n                                                                              BV\n                                                                           \n                                                                           1\n                                                                        \n                                                                        ,\n                                                                        \n                                                                           \n                                                                              BV\n                                                                           \n                                                                           2\n                                                                        \n                                                                        ,\n                                                                        ⋯\n                                                                        ,\n                                                                        \n                                                                           \n                                                                              BV\n                                                                           \n                                                                           i\n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                               \n                                                                  \n                                                                     \n                                                                        \n                                                                           \n                                                                              SR\n                                                                           \n                                                                           1\n                                                                        \n                                                                        ,\n                                                                        \n                                                                           \n                                                                              SR\n                                                                           \n                                                                           2\n                                                                        \n                                                                        ,\n                                                                        ⋯\n                                                                        ,\n                                                                        \n                                                                           \n                                                                              SR\n                                                                           \n                                                                           i\n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                               \n                                                                  \n                                                                     \n                                                                        \n                                                                           \n                                                                              SW\n                                                                           \n                                                                           1\n                                                                        \n                                                                        ,\n                                                                        \n                                                                           \n                                                                              SW\n                                                                           \n                                                                           2\n                                                                        \n                                                                        ,\n                                                                        ⋯\n                                                                        ,\n                                                                        \n                                                                           \n                                                                              SW\n                                                                           \n                                                                           i\n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                               \n                                                                  \n                                                                     \n                                                                        ⋮\n                                                                        ⋮\n                                                                        ⋮\n                                                                     \n                                                                  \n                                                               \n                                                            \n                                                         \n                                                      \n                                                   \n                                                   \n                                                      \n                                                         \n                                                            \n                                                               \n                                                                  PR\n                                                               \n                                                               1\n                                                            \n                                                            ,\n                                                            \n                                                               \n                                                                  PR\n                                                               \n                                                               2\n                                                            \n                                                            ,\n                                                            ⋯\n                                                            ,\n                                                            \n                                                               \n                                                                  PR\n                                                               \n                                                               i\n                                                            \n                                                         \n                                                      \n                                                   \n                                                \n                                             \n                                          \n                                       \n                                    \n                                    ,\n                                    φ\n                                    ∈\n                                    O\n                                    D\n                                    D\n                                 \n                              \n                           \n                        \n                      where \n                           \n                              BV\n                           \n                        , \n                           \n                              SR\n                           \n                        , \n                           \n                              SW\n                           \n                        , and \n                           \n                              PR\n                           \n                         denote background vehicle, speed range, specified weather condition, and perception range, respectively. Essentially, the situational context represents a particular situation because of a specific scenario. Mathematically, a situation context contains a unified view of everything involved in a particular scenario:\n                           \n                              (3)\n                              \n                                 \n                                    S\n                                    =\n                                    \n                                       \n                                          \n                                             \n                                                φ\n                                                1\n                                             \n                                             ,\n                                             \n                                                φ\n                                                2\n                                             \n                                             ,\n                                             \n                                                φ\n                                                3\n                                             \n                                             ⋯\n                                             ,\n                                             \n                                                φ\n                                                i\n                                             \n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                        \n                      where \n                           \n                              S\n                           \n                         denotes a specific event (i.e., situational context), \n                           \n                              φ\n                           \n                         denotes a scenario. Considering situational contexts of “operational interruptions”, the relevant features involved in the corresponding scenarios are the potential “contributing factors”. For example, ADS operation might be affected or intervened during DDTs due to environmental (i.e., road, traffic, or weather conditions) disruptions or subjective actions (i.e., human behavior). Moreover, such effects are pointing out the boundaries of the ODD wherein the ADS faces limitations, posing threats to safety. The investigation in this study comprehensively analyzed a diverse array of contributing factors leading to operational interruptions in the high-level ADS.", "subsubsections": []}, {"label": "2.2", "title": "Scenario criticality measurement", "text": "The concept of scenario criticality is not entirely new in the literature. Althoff and Lutz (2018), Feng et al. (2020), and Nolet et al. (2020) discussed scenario criticality in their work and argued that the criticality of a specific driving scenario primarily depends on the probability of engaging traffic conflicts. To measure traffic conflicts, the Surrogate Safety Assessment Model (SSAM) was applied in this study. As a mature model for road safety assessment, SSAM is considered a positive alternative for assessing safety–critical events for AVs and mixed environments (Arun et al., 2021). In this study, SSAM processed the extracted trajectories of the simulated high-level ADS concerning various conflict types in a mixed traffic environment, including vehicle-vehicle, vehicle-bicycle, and vehicle–pedestrian, with the nominated safety indicators of time-to-collision (TTC) and post-encroachment time (PET) (Wang et al., 2021). To best reflect the situational difference, TTC reflects the time for a collision between two road users based on their motions, while PET indicates the difference in time between two road users reaching the same conflict point. Mathematically, they are calculated using equations below:\n                           \n                              (4)\n                              \n                                 \n                                    \n                                       \n                                          TTC\n                                       \n                                       \n                                          i\n                                       \n                                    \n                                    =\n                                    \n                                       \n                                          \n                                             \n                                                X\n                                             \n                                             \n                                                i\n                                                -\n                                                1\n                                             \n                                          \n                                          \n                                             \n                                                t\n                                             \n                                          \n                                          -\n                                          \n                                             \n                                                X\n                                             \n                                             \n                                                i\n                                             \n                                          \n                                          \n                                             \n                                                t\n                                             \n                                          \n                                          -\n                                          \n                                             \n                                                l\n                                             \n                                             \n                                                i\n                                             \n                                          \n                                       \n                                       \n                                          \n                                             \n                                                \n                                                   \n                                                      X\n                                                   \n                                                   \n                                                      ̇\n                                                   \n                                                \n                                             \n                                             \n                                                i\n                                             \n                                          \n                                          \n                                             \n                                                t\n                                             \n                                          \n                                          -\n                                          \n                                             \n                                                \n                                                   \n                                                      X\n                                                   \n                                                   \n                                                      ̇\n                                                   \n                                                \n                                             \n                                             \n                                                i\n                                                -\n                                                1\n                                             \n                                          \n                                          \n                                             \n                                                t\n                                             \n                                          \n                                       \n                                    \n                                    \n                                    ∀\n                                    \n                                       \n                                          \n                                             \n                                                X\n                                             \n                                             \n                                                ̇\n                                             \n                                          \n                                       \n                                       \n                                          i\n                                       \n                                    \n                                    \n                                       \n                                          t\n                                       \n                                    \n                                    >\n                                    \n                                       \n                                          \n                                             \n                                                X\n                                             \n                                             \n                                                ̇\n                                             \n                                          \n                                       \n                                       \n                                          i\n                                          -\n                                          1\n                                       \n                                    \n                                    \n                                       \n                                          t\n                                       \n                                    \n                                 \n                              \n                           \n                        \n                        \n                           \n                              (5)\n                              \n                                 \n                                    \n                                       \n                                          PET\n                                       \n                                       i\n                                    \n                                    =\n                                    \n                                       t\n                                       i\n                                    \n                                    -\n                                    \n                                       t\n                                       \n                                          i\n                                          -\n                                          1\n                                       \n                                    \n                                 \n                              \n                           \n                        \n                      where the TTC between the road user \n                           \n                              i\n                           \n                         at instant \n                           \n                              t\n                           \n                         and its leading road user \n                           \n                              i\n                              -\n                              1\n                           \n                         is estimated by their speeds \n                           \n                              \n                                 \n                                    X\n                                    ̇\n                                 \n                                 i\n                              \n                           \n                         and vehicle lengths \n                           \n                              \n                                 l\n                                 i\n                              \n                           \n                        ; the PET is determined by the difference between the instantaneous time of the first road user leaving the conflict point \n                           \n                              \n                                 t\n                                 \n                                    i\n                                    -\n                                    1\n                                 \n                              \n                           \n                         and the time that second road user reaching the conflict point \n                           \n                              \n                                 t\n                                 i\n                              \n                           \n                        . Given the capability of the high-level ADS to maintain close proximity securely during the operation, the critical safety thresholds of TTC and PET were set to 1 s, which is smaller compared to conventional vehicle cases. This is consistent with the findings from previous studies (Morando et al., 2018; \n                        Alozi and Hussein, 2022; Xu et al., 2022b). The output from SSAM generally includes the locations, frequency, and variance of conflicts/crashes that occurred, as well as the probability of potential conflicts/crashes. Based on the output of the SSAM, potential contributing factors to AV-involved safety–critical events could be therefore extracted, and the impact of contributing factors on traffic conflicts could be estimated according to the conflict frequency. Logically, the more scenario inputs to the SSAM, the broader possible situational contexts would be covered. The next task was to use this measurement to investigate the scenarios where the conflicts/crashes occurred most frequently, so that to identify the characteristics referring to \n                           \n                              \n                                 φ\n                                 i\n                              \n                           \n                         in section 2.1 of such scenarios. Shapley additive explanations (SHAP) developed by Lundberg and Lee (2017) was applied for data interpretation of over 10,000 combinations of driving scenarios to identify the most relevant contributing factors to ADS-involved traffic conflicts/crashes. Fundamentally, SHAP computes the average marginal contribution of every single variable to a predicted result, considering a weighted average of all possible differences. It has been widely applied for machine learning involved studies for the interpretation of model predictions considering the impacts of variables that are correlated or independent (see in Kumar and Todorov, 2015; \n                        Feng et al., 2021a; Kalatian and Farooq, 2021). Mathematically, the Shapley value \n                           \n                              \n                                 Φ\n                                 \n                                    iv\n                                 \n                              \n                           \n                         of each independent variable \n                           \n                              iv\n                           \n                         is calculated by Eq. (6).\n                           \n                              (6)\n                              \n                                 \n                                    \n                                       Φ\n                                       \n                                          iv\n                                       \n                                    \n                                    =\n                                    \n                                       ∑\n                                       \n                                          F\n                                          ∈\n                                          \n                                             φ\n                                             i\n                                          \n                                          \n                                             \\\n                                             \n                                                {\n                                                i\n                                                v\n                                                }\n                                             \n                                          \n                                       \n                                    \n                                    \n                                       \n                                          \n                                             \n                                                F\n                                             \n                                          \n                                          !\n                                          \n                                             \n                                                \n                                                   \n                                                      \n                                                         \n                                                            φ\n                                                            i\n                                                         \n                                                      \n                                                   \n                                                   -\n                                                   \n                                                      \n                                                         \n                                                            F\n                                                         \n                                                      \n                                                   \n                                                   -\n                                                   1\n                                                \n                                             \n                                          \n                                          !\n                                       \n                                       \n                                          \n                                             \n                                                \n                                                   φ\n                                                   i\n                                                \n                                             \n                                          \n                                          !\n                                       \n                                    \n                                    \n                                       \n                                          \n                                             \n                                                G\n                                                \n                                                   F\n                                                   ∪\n                                                   \n                                                      \n                                                         \n                                                            i\n                                                            v\n                                                         \n                                                      \n                                                   \n                                                \n                                             \n                                             \n                                                \n                                                   \n                                                      x\n                                                   \n                                                   \n                                                      ¯\n                                                   \n                                                \n                                                \n                                                   F\n                                                   ∪\n                                                   \n                                                      \n                                                         \n                                                            i\n                                                            v\n                                                         \n                                                      \n                                                   \n                                                \n                                             \n                                             -\n                                             \n                                                G\n                                                F\n                                             \n                                             \n                                                \n                                                   \n                                                      x\n                                                   \n                                                   \n                                                      ¯\n                                                   \n                                                \n                                                F\n                                             \n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                        \n                      where \n                           \n                              F\n                           \n                         denotes all features (e.g., specified traffic volume, speed range, weather, etc.) as a subset of independent variables within a scene \n                           \n                              \n                                 φ\n                                 i\n                              \n                           \n                        ; \n                           \n                              \n                                 G\n                                 \n                                    F\n                                    ∪\n                                    \n                                       \n                                          \n                                             i\n                                             v\n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                         and \n                           \n                              \n                                 G\n                                 F\n                              \n                           \n                         are fine-tuned functions for the assignment of importance to each feature, in which \n                           \n                              \n                                 G\n                                 \n                                    F\n                                    ∪\n                                    \n                                       \n                                          \n                                             i\n                                             v\n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                         is trained with the presented features and \n                           \n                              \n                                 G\n                                 S\n                              \n                           \n                         is trained for the withheld features; \n                           \n                              \n                                 \n                                    \n                                       x\n                                    \n                                    \n                                       ¯\n                                    \n                                 \n                                 \n                                    F\n                                    ∪\n                                    \n                                       \n                                          \n                                             i\n                                             v\n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                         and \n                           \n                              \n                                 \n                                    \n                                       x\n                                    \n                                    \n                                       ¯\n                                    \n                                 \n                                 F\n                              \n                           \n                         denote the values of the input features in corresponding sets, respectively. Having the features of a scenario where traffic conflicts/crashes occurred frequently, a criticality value \n                           \n                              V\n                              (\n                              \n                                 x\n                                 i\n                              \n                              |\n                              θ\n                              )\n                           \n                         can therefore be written as:\n                           \n                              (7)\n                              \n                                 \n                                    V\n                                    \n                                       \n                                          \n                                             \n                                                x\n                                                i\n                                             \n                                             \n                                                |\n                                                θ\n                                             \n                                          \n                                       \n                                    \n                                    \n                                       =\n                                       \n                                          def\n                                       \n                                    \n                                    P\n                                    \n                                       \n                                          \n                                             \n                                                S\n                                                |\n                                             \n                                             \n                                                x\n                                                i\n                                             \n                                             ,\n                                             θ\n                                          \n                                       \n                                    \n                                    P\n                                    \n                                       \n                                          \n                                             \n                                                x\n                                                i\n                                             \n                                             \n                                                |\n                                                θ\n                                             \n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                        \n                      where \n                           \n                              \n                                 x\n                                 i\n                              \n                           \n                         denotes the key feature that contributed to traffic conflicts/crashes; \n                           \n                              θ\n                           \n                         is an aggregation of variables that contribute to critical scenario; \n                           \n                              P\n                              \n                                 \n                                    \n                                       \n                                          S\n                                          |\n                                       \n                                       \n                                          x\n                                          i\n                                       \n                                       ,\n                                       θ\n                                    \n                                 \n                              \n                           \n                         is the probability of an event (i.e., the situational context) S in scenario with features \n                           \n                              (\n                              \n                                 x\n                                 i\n                              \n                              ,\n                              θ\n                              )\n                           \n                        ; \n                           \n                              P\n                              (\n                              \n                                 x\n                                 i\n                              \n                              |\n                              θ\n                              )\n                           \n                         is the occurrence probability of feature \n                           \n                              \n                                 x\n                                 i\n                              \n                           \n                        , which represents the exposure frequency. Meanwhile, the importance of such features contributing to potential traffic conflicts could also be obtained. Since a critical scenario might not be one of the genuine subsets of \n                           \n                              \n                                 φ\n                                 i\n                              \n                           \n                         (e.g., accident due to ADS malfunction), the ∊-greedy sampling policy was applied so that critical scenarios within and outside ODD could be both considered. This policy allows for a logical balance between exploitation and exploration concerning random selection. Theoretically, it selects scenarios greedily and randomly with a small probability \n                           \n                              ∊\n                           \n                         based on both the normalized criticality values from the sets of \n                           \n                              φ\n                           \n                         and \n                           \n                              X\n                              \\\n                              φ\n                           \n                         (Tokic, 2010). It is compatible with the domain knowledge of AVs (Feng et al., 2020; Lin et al., 2020), and outperforms other sampling techniques such as Cross Entropy method (De Boer et al., 2005) and Monte Carlo Theory (James, 1980). As a result, scenarios within and outside ODD could be equivalently selected. Mathematically, the sampling process is based on the following equations:\n                           \n                              (8)\n                              \n                                 \n                                    \n                                       \n                                          \n                                             P\n                                             I\n                                          \n                                       \n                                       \n                                          ¯\n                                       \n                                    \n                                    \n                                       \n                                          \n                                             \n                                                x\n                                                i\n                                             \n                                             \n                                                |\n                                                θ\n                                             \n                                          \n                                       \n                                    \n                                    =\n                                    \n                                       \n                                          \n                                             \n                                                \n                                                   \n                                                      \n                                                         \n                                                            \n                                                               \n                                                                  \n                                                                     \n                                                                        1\n                                                                        -\n                                                                        ∊\n                                                                     \n                                                                  \n                                                                  V\n                                                                  \n                                                                     \n                                                                        \n                                                                           \n                                                                              x\n                                                                              i\n                                                                           \n                                                                           \n                                                                              |\n                                                                              θ\n                                                                           \n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                               W\n                                                            \n                                                            \n                                                               \n                                                                  \n                                                                     \n                                                                        x\n                                                                        i\n                                                                     \n                                                                     ∈\n                                                                     φ\n                                                                  \n                                                               \n                                                            \n                                                         \n                                                      \n                                                   \n                                                   \n                                                      \n                                                         \n                                                            \n                                                               ∊\n                                                               \n                                                                  N\n                                                                  \n                                                                     \n                                                                        \n                                                                           X\n                                                                        \n                                                                     \n                                                                  \n                                                                  -\n                                                                  N\n                                                                  \n                                                                     \n                                                                        \n                                                                           φ\n                                                                        \n                                                                     \n                                                                  \n                                                               \n                                                            \n                                                            \n                                                               \n                                                                  \n                                                                     \n                                                                        x\n                                                                        i\n                                                                     \n                                                                     \n                                                                        ∈\n                                                                        X\n                                                                        \\\n                                                                        φ\n                                                                     \n                                                                  \n                                                               \n                                                            \n                                                         \n                                                      \n                                                   \n                                                \n                                             \n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                        \n                        \n                           \n                              (9)\n                              \n                                 \n                                    W\n                                    =\n                                    \n                                       ∑\n                                       \n                                          \n                                             x\n                                             i\n                                          \n                                          ∈\n                                          θ\n                                       \n                                    \n                                    V\n                                    \n                                       \n                                          \n                                             \n                                                x\n                                                i\n                                             \n                                             \n                                                |\n                                                φ\n                                             \n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                        \n                      where \n                           \n                              V\n                              (\n                              \n                                 x\n                                 i\n                              \n                              |\n                              θ\n                              )\n                           \n                         represents the criticality value; \n                           \n                              N\n                              \n                                 \n                                    \n                                       X\n                                    \n                                 \n                              \n                           \n                         and \n                           \n                              N\n                              \n                                 \n                                    \n                                       φ\n                                    \n                                 \n                              \n                           \n                         denote the total number of scenarios that are outside and inside ODD, respectively. Thus, \n                           \n                              \n                                 \n                                    \n                                       P\n                                       I\n                                    \n                                 \n                                 \n                                    ¯\n                                 \n                              \n                              \n                                 \n                                    \n                                       \n                                          x\n                                          i\n                                       \n                                       \n                                          |\n                                          θ\n                                       \n                                    \n                                 \n                              \n                           \n                         measures the probability that ADS encounters an interaction event under a critical circumstance where \n                           \n                              W\n                           \n                         is a normalization factor. According to the identified linear correlation (R2 = 0.98) between the scenario criticality \n                           \n                              σ\n                           \n                         and \n                           \n                              \n                                 \n                                    \n                                       P\n                                       I\n                                    \n                                 \n                                 \n                                    ¯\n                                 \n                              \n                              \n                                 \n                                    \n                                       \n                                          x\n                                          i\n                                       \n                                       \n                                          |\n                                          θ\n                                       \n                                    \n                                 \n                              \n                           \n                        , the \n                           \n                              σ\n                           \n                         can be determined via formulating a linear regression model as a function of \n                           \n                              \n                                 \n                                    \n                                       P\n                                       I\n                                    \n                                 \n                                 \n                                    ¯\n                                 \n                              \n                              \n                                 \n                                    \n                                       \n                                          x\n                                          i\n                                       \n                                       \n                                          |\n                                          θ\n                                       \n                                    \n                                 \n                              \n                           \n                        :\n                           \n                              (10)\n                              \n                                 \n                                    \n                                       σ\n                                       i\n                                    \n                                    =\n                                    \n                                       δ\n                                       i\n                                    \n                                    ∙\n                                    \n                                       \n                                          \n                                             P\n                                             I\n                                          \n                                       \n                                       \n                                          ¯\n                                       \n                                    \n                                    \n                                       \n                                          \n                                             \n                                                x\n                                                i\n                                             \n                                             \n                                                |\n                                                θ\n                                             \n                                          \n                                       \n                                    \n                                    +\n                                    ε\n                                 \n                              \n                           \n                        \n                      where \n                           \n                              \n                                 δ\n                                 i\n                              \n                           \n                         is a dummy decision variable (i.e., 0–1) with respect to whether the ADS react under certain situational contexts, and \n                           \n                              ε\n                           \n                         denotes an error term to balance the deviation of feature importance.", "subsubsections": []}, {"label": "2.3", "title": "Development of the simulation environment", "text": "", "subsubsections": [{"label": "2.3.1", "title": "Scenario generation", "text": "This work employed a VR-enabled and microsimulation-integrated simulation environment. We built upon the well-established CARLA platform (Dosovitskiy et al., 2017), based on the Unreal Engine (Sanders, 2016). The proposed platform provides both graphical and interactive fidelities to improve visual effects and user experience. There are thousands of digital assets inculding road designs, buildings, structures, and infrastructure facilities provided by CARLA to build over twelve different urban layouts. The constructed platform allows for flexible generations of road users, road networks, as well as meteorological conditions that are defined by weather and lightings. Fig. 2\n                            displays an example of environment generation. To create a simulated testing environment, the following sequential stages were involved: (a) road network framing and construction, (b) create or assign the existing 3D models according to the designed framework, (c) environment rendering, and (d) traffic scenario reproduction. Although CARLA platform supports the generation of background vehicles (BVs), the motions of BVs are pre-determined following fixed trajectories that are defined by waypoints, and therefore lack flexibility and realism compared to the real-world traffic flow (Feng et al., 2021b; Xu et al., 2021a). To this end, the traffic microsimulation tool VISSIM was integrated into the CARLA to reproduce realistic traffic dynamics. Different from traffic manager system in CARLA, VISSIM generates vehicles randomly for each link, and traffic flow develops in time rather than remain constant (thus adjustable from zero to the capacity) (Fellendorf and amd Vortisch, 2010). The co-simulation strategy facilitates real-time bidirectional communication between CARLA and VISSIM. Specifically, traffic dynamics generated in VISSIM can be fully imported into CARLA, providing a seamless integration of the two platforms. Conversely, environmental effects impacting situations within CARLA can be simultaneously reflected back into VISSIM. This symbiotic relationship allows for a comprehensive and dynamic simulation environment, enriching the fidelity and depth of autonomous driving research. Vehicle-vehicle dynamics are important to study ADS. VISSIM incorporates a calibrated Wiedemann 99 behavioral model to reproduce human-resembled lane-changing, overtaking, or even illegal driving behavior (Fan et al., 2013; Mai et al., 2019). The reliability of cyclists and pedestrians was also considered in simulation. In VISSIM, the reproduced cyclists are mainly based on the W99 behavioral model, which lacks detailed reflection in lateral movements, especially within the intersections (Castro et al., 2022). Different from the motor- and non-motorized road users, the reproduced pedestrians in microsimulation are principally based on the social force model (Helbing and Molnar, 1995). Although pedestrian behavior is modelled logically based on this calibrated utility model, the reaction of pedestrians to vehicles is generally more sensitive in simulations, and the opinion of decisions cannot be reflected intellectually (Zeng et al., 2014). To address the limitations in the representation of cyclists and pedestrians and enhance the testing environment’s reliability, we integrated the Unreal Engine Navigation System driven by the Reciprocal Velocity Obstacles (RVO) algorithm (Sun et al., 2022; Torrens and Gu, 2023), along with the multi-layer behavior modelling strategy (Colledanchise and Natale, 2021), into the VISSIM-generated road users. Taking advantage of such a behavior modelling strategy, human factors could be involved in the present study. According to the empirical analysis, approximately 10 % of road users would conduct illegal behavior intentionally or unconsciously (Treat et al., 1979). This phenomenon was programmed in simulation, where 10 % of the road users could intentional exhibit non-compliant behaviors against the rules. As a result, the road users were encouraged to follow the basic traffic rules but 10 % of them were allowed to cross roads at any points. This could significantly improve the reliability of simulated environments, and thus the situational perceptions and behavioral reactions of either the ADS or riders who sit in the AV would be more comparable with real-life cases. The explicit calibration procedures have been demonstrated in previous studies (Guo et al., 2022; Xu et al., 2023), where readers are referred for more details. Fig. 3\n                            provides a visual depiction of the co-simulation strategy, showcasing some typical situational contexts that arise under various scenarios."}, {"label": "2.3.2", "title": "ADS model and ODD boundary", "text": "To achieve the high-level autonomous driving under the reproduced scenarios, the ADS control model was recalibrated. In essence, the calibration process is about developing the extraordinary functionality of the AI agents with respect to operation, navigation, collision avoidance, and damage detection. Therefore, we adopted the deep reinforcement learning architecture proposed by Mnih et al. (2015) to train the ADS algorithm. Variables such as object locations, lighting conditions, ego-lane, and traffic control measurements were included in the training process, and an end-to-end testing module and noise injection systems guaranteed the robustness of the learning results. A perturbation that forms a linear fluctuation was added to simulate gradual drift from the desired trajectory due to unexpected driving maneuvers, which forms a triangular impulse that is parametrized by its starting time, duration, and intensity:\n                              \n                                 (11)\n                                 \n                                    \n                                       S\n                                       \n                                          \n                                             \n                                                t\n                                             \n                                          \n                                       \n                                       =\n                                       α\n                                       γ\n                                       max\n                                       \n                                          \n                                             \n                                                0\n                                                ,\n                                                \n                                                   \n                                                      \n                                                         1\n                                                         -\n                                                         \n                                                            \n                                                               \n                                                                  \n                                                                     \n                                                                        2\n                                                                        \n                                                                           \n                                                                              \n                                                                                 t\n                                                                                 -\n                                                                                 \n                                                                                    t\n                                                                                    0\n                                                                                 \n                                                                              \n                                                                           \n                                                                        \n                                                                     \n                                                                     τ\n                                                                  \n                                                                  -\n                                                                  1\n                                                               \n                                                            \n                                                         \n                                                      \n                                                   \n                                                \n                                             \n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                         where \n                              \n                                 α\n                                 ∈\n                                 [\n                                 -\n                                 \n                                    1\n                                    ,\n                                    1\n                                 \n                                 ]\n                              \n                            denotes the sign perceived by the agent, \n                              \n                                 γ\n                                 ∈\n                                 \n                                    \n                                       R\n                                    \n                                    +\n                                 \n                              \n                            represents the intensity, \n                              \n                                 τ\n                                 ∈\n                                 \n                                    \n                                       R\n                                    \n                                    +\n                                 \n                              \n                            denotes duration, and \n                              \n                                 \n                                    t\n                                    0\n                                 \n                              \n                            denotes a randomized starting time. According to Dosovitskiy et al. (2017), the learning rate is linearly decreased to zero over the course of training. The weighted sum of five critical variables was selected as a measure on “reward” during the learning process, until the agent is well-trained:\n                              \n                                 (12)\n                                 \n                                    \n                                       \n                                          r\n                                          \n                                             RL\n                                          \n                                       \n                                       =\n                                       1000\n                                       \n                                          \n                                             \n                                                \n                                                   d\n                                                   \n                                                      t\n                                                      -\n                                                      1\n                                                   \n                                                \n                                                -\n                                                \n                                                   d\n                                                   t\n                                                \n                                             \n                                          \n                                       \n                                       +\n                                       0.05\n                                       \n                                          \n                                             \n                                                \n                                                   v\n                                                   t\n                                                \n                                                -\n                                                \n                                                   v\n                                                   \n                                                      t\n                                                      -\n                                                      1\n                                                   \n                                                \n                                             \n                                          \n                                       \n                                       -\n                                       0.00002\n                                       \n                                          \n                                             \n                                                \n                                                   c\n                                                   t\n                                                \n                                                -\n                                                \n                                                   c\n                                                   \n                                                      t\n                                                      -\n                                                      1\n                                                   \n                                                \n                                             \n                                          \n                                       \n                                       -\n                                       2\n                                       \n                                          \n                                             \n                                                \n                                                   s\n                                                   t\n                                                \n                                                -\n                                                \n                                                   s\n                                                   \n                                                      t\n                                                      -\n                                                      1\n                                                   \n                                                \n                                             \n                                          \n                                       \n                                       -\n                                       2\n                                       \n                                          \n                                             \n                                                \n                                                   o\n                                                   t\n                                                \n                                                -\n                                                \n                                                   o\n                                                   \n                                                      t\n                                                      -\n                                                      1\n                                                   \n                                                \n                                             \n                                          \n                                       \n                                    \n                                 \n                              \n                           \n                         where \n                              \n                                 d\n                                 (\n                                 k\n                                 m\n                                 )\n                              \n                            denotes the goal of navigation, \n                              \n                                 v\n                                 (\n                                 k\n                                 m\n                                 /\n                                 h\n                                 )\n                              \n                            denotes vehicle velocity, \n                              \n                                 c\n                              \n                            represents collision damage, \n                              \n                                 s\n                                 =\n                                 [\n                                 \n                                    0\n                                    ,\n                                    1\n                                 \n                                 ]\n                              \n                            measures the sidewalk, and \n                              \n                                 o\n                                 =\n                                 [\n                                 \n                                    0\n                                    ,\n                                    1\n                                 \n                                 ]\n                              \n                            represents the intersection with the opposite lane. The ultimate goal of ADS model recalibration was to ensure that DDTs could be carried out effectively and securely within ODDs. However, the diversity inherent in the reproduced behavior of road users using the proposed co-simulation strategy could potentially impose constraints on ADS, thereby presenting the ODD boundaries. Therefore, to fulfill the assumption of stable autonomous driving, it is imperative for the ADS model to be capable of adapting to the behavioral patterns exhibited by the integrated background road users. The benchmark performance for ADS in CARLA’s default scenes and scenarios—without any model integration—was derived from an extensive training set of over 10 million iterations (Dosovitskiy et al., 2017). Once the autopilot mode is activated, the vehicle can function optimally in terms of both motion control and collision avoidance, resulting in an impressively low accident rate of around 4 %. This performance can be maintained while the vehicle is interacting with road users who follow predetermined trajectories based on presupposed waypoints under any conditions. Thus, this benchmark was considered the “ground truth” against which the outcomes of the ADS performance under the proposed co-simulation environments where the behavior of background road users might be subject to changes. Specifically, the performance of the calibrated ADS could be generally reflected in variation in velocity (i.e., instantaneous speed of the AV measured along its travelling path), lateral deviation (i.e., the distance between the position of the AV and the centreline on a lane), and accident rate (i.e., the occasions that AV has collided with other objects) as learning process proceeds under various traffic and environmental conditions (Dosovitskiy et al., 2017). It is only when the performance of the ADS attains optimal operational conditions that the assumption of high-level autonomy (Level 4 as defined by SAE International, 2018) becomes a reasonable proposition. Furthermore, since most of CARLA’s default scenes are modelled referring to the layout of cities in the US (Dosovitskiy et al., 2017), there may be limitations in convincing participants from other regions that the scenarios featuring the ADS are universally applicable or futuristic. To this end, two additional scenes were manually modelled and added to CARLA platform (Fig. 4\n                           (a4) & (a5)). The added scenes were carefully developed to reproduce two local areas in Melbourne, Australia: (1) a scene containing urban driving and freeway merging sections, and (2) a scene containing a central business district. The development processes were adopted from previous work (Xu et al., 2021b; Xu et al., 2022a). Specific environmental sensing deployment was also incorporated to ensure V2I (vehicle to infrastructure) quality. The reinforcement learning was executed in newly added scenes again under various traffic and environmental conditions; however, given the limited iterations involved in the training process, these senses could also be potentially considered the ODD boundaries. A comparison of ADS performance in both CARLA’s default scenes and newly added scenes was also conducted to evaluate the training outcome. As shown in Fig. 4, the ADS developed effective and safe operation with around 5,000 iterations, featuring a stable lateral position with an average deviation of 0.1 m, and an accident rate of around 0.04 ultimately (Fig. 4c). Fig. 4a provides an illustrative example from a training session, depicting a scenario where the ADS navigates a freeway and encounters an accident to its left. Fig. 4(a1) displays a panoramic view captured at this specific frame, while Fig. 4(a2) and 4(a3) present the views as perceived through optical and LiDAR sensors, respectively. Overall, the performance of ADS formed a very similar trend under both the co-simulated environment and newly added scenes through the training process. This is reflected thoroughly in the accident type (Fig. 4b1) and the distributions of PET (Fig. 4b2) and TTC (Fig. 4b3). Eventually, no substantial differences were observed in the ADS’s perception and reaction capabilities when operating in both the co-simulated environments and the newly added scenes, as compared to its benchmark performance in CARLA’s default settings. This indicates a robust and consistent level of performance across diverse operational conditions. In summary, the analytical methodology employed in this research comprises the following key steps:\n                              \n                                 (1)\n                                 Establishing testing environments for the ADS.\n                              \n                              \n                                 (2)\n                                 Estimating traffic conflicts and crashes under a variety of scenarios.\n                              \n                              \n                                 (3)\n                                 Identifying the features that contribute to these traffic conflicts and crashes.\n                              \n                              \n                                 (4)\n                                 Selecting scenarios that exhibit these identified features for closer examination.\n                              \n                              \n                                 (5)\n                                 Translating the level of criticality of these selected scenarios from the sampled scenario library.\n                              \n                           \n                         These steps form a comprehensive framework designed to rigorously assess and improve the performance and reliability of ADS in varying traffic conditions. Fig. 5\n                            provides a graphical demonstration of the methodological framework."}]}]}, {"label": "3", "title": "Criticality ranking and verification", "text": "This research was conducted using a combination of simulations and human-in-the-loop experiments. This section introduces a ranking principle for assessing scenario criticality in mixed traffic involving ADS, based on the analytic methods we proposed in Section 2. Additionally, we outline the experimental design aimed at exploring human perspectives on these ranked levels of criticality, thereby providing a comprehensive view of both machine and human factors in traffic safety concerning the high-level autonomous driving.", "subsections": [{"label": "3.1", "title": "Criticality ranking", "text": "In essence, the key features of a scenario are significantly reflected in the prevailing traffic conditions. Based on the enumerated investigation for over 10,000 combinations of driving scenarios, the scenarios where the ADS encounter safety–critical issues (as assessed by SSAM) were screened, and the features such as traffic and environmental factors involved in those scenarios were extracted with the assistance of the Time Series Feature Extraction package (Barandas et al., 2020). According to the measured safety performance of the ADS, the number of extracted scenarios is listed in Table 1\n                        . Then the SHAP interpretation (as outlined in subsection 2.2) could analyze the features and demonstrate the importance of the determine variables (i.e., key features) contributing to ADS-involved traffic conflicts/crashes. In this case, SHAP quantifies each feature’s contribution to a given prediction (i.e., safety–critical events), assessing the extent to which individual features influence the SSAM’s output in the direction of that prediction. Taking into account the impacts of ODD boundaries, the ADS performance during the training stage was also investigated. Compared to the fine-tuned ADS performance, contributing factors to safety–critical events are different. Fig. 6\n                         presents the SHAP interpretations, summarizing the importance of various contributing factors to critical events involving the ADS, both outside and within the ODD. This graphical representation provides a comprehensive view of the key elements that influence the safety and performance of the ADS across different operational conditions. In Fig. 6, the importance of each variable (i.e., feature) contributes to ADS-involved critical situations (i.e., TTC ≤ 1.0 s, and PET ≤ 1.0 s) is interpreted by SHAP values. In this study, the default baseline SHAP value of 0 indicates the significant impact of such a variable on critical situations. The positive and negative effects of the variable on critical situations are interpreted as the SHAP values that are greater than 0 and smaller than 0, respectively. The importance of the feature contribution is represented in colours, with the extent of importance coloured from blue to red, while the grey colour denotes that there was no significant impact of such a variable on safety–critical events throughout the investigation. In addition to the indicated importance of variables, SHAP interprets the importance of variables on instances as a result of interconnection and correlation between variables. The summarized key variables (i.e., features in a scenario) that contributed to safety–critical events during the training stage are illustrated in Fig. 6a, suggesting that the critical situations were significantly associated with perception and action failures, especially in the face of severe weather conditions where the ADS struggled to accurately identify dynamic elements. This is attributable to the pivotal role that the sensing system plays in maintaining stable ADS operation. The functionality of ADS in vehicular control could be substantially compromised by dynamic weather conditions, especially under extreme circumstances. This highlights the need for rigorous testing and calibration of the ADS’s sensing and motion capabilities to ensure reliability across a range of environmental conditions. Once the ADS has been fine-tuned to recognize the surroundings as ODD, the primary challenge to its operation stems from exceptional behaviors, particularly those influenced by road disruptions and visibility issues (Fig. 6b). This is because background road users are more susceptible to adverse conditions related to lighting and visibility, making them more likely to engage in behavior that could lead to accidents, especially in the presence of road disruptions. This study was primarily centered on the DDTs executed by a calibrated, high-level ADS within the ODD. With the assistance of the SSAM and SHAP interpretation regarding key features that can contribute to safety–critical events, the scenario criticality was categorized into three classes. Specifically, we define the scenario criticality according to the ADS’s safety performance during the operation. For example, the scenarios where the most ADS-involved traffic conflicts or even crashes (TTC → 0 & PET → 0) occurred are the class I scenarios, with the quantified scenario criticality of greater than 0.7. Scenarios in which ADS-involved traffic conflicts can be detected, but accidents are infrequent, fall under the classification of Class II scenarios, with the calculated scenario criticality between 0.4 and 0.7. For those scenarios where the ADS would encounter maneuver challenges infrequently (\n                           \n                              \n                                 \n                                    \n                                       T\n                                    \n                                    \n                                       T\n                                    \n                                    \n                                       C\n                                    \n                                 \n                                 \n                                    ¯\n                                 \n                              \n                           \n                         > 1.5 s & \n                           \n                              \n                                 \n                                    \n                                       P\n                                    \n                                    \n                                       E\n                                    \n                                    \n                                       T\n                                    \n                                 \n                                 \n                                    ¯\n                                 \n                              \n                           \n                         > 3.0 s), a tag of Class III with a value of less than 0.4 is applied. Table 2\n                         provides a numerical understanding of the criticality ranking concerning the ADS’s operation within the ODD, with the average and standard deviation of SHAP values indicating relevance. According to the rule of thumb (Kalatian and Farooq, 2021; Feng et al., 2021b), the overall contribution of a specific feature is interpretable if it poses a uniform effect on an event. Numerically, for a particular determine variable (as listed in Table 2), a uniform effect of such a variable on ADS-involved traffic conflicts/crashes is reflected in the absolute mean of SHAP value that is larger than its standard deviation. Furthermore, the non-uniformity of SHAP values does not suggest the interaction between such variables and the events (i.e., traffic conflicts/crashes) is insignificant. On the contrary, such SHAP values indicate a complex correlation between variables and the event. In this case, compared to the less interfered ADS operational status under the influence of relative speed, road geometry, lane number, etc., the performance of the fine-tuned high-level ADS could be significantly affected by exceptional road user behavior (e.g., illegal crossing, driving, cycling, etc.), especially when it was associated with road disruptions and visibility issues. Weather indirectly affects ADS operation by influencing the behavior of other road users. Notably, inadequate lighting and visibility were correlated with most safety–critical events involving ADS, but there were no significant differences in the frequency of conflicts or crashes between various precipitation conditions and fine weather conditions. It is also noteworthy that throughout the investigation, no traffic conflicts (i.e., TTC ≤ 1.0 s and PET ≤ 1.0 s) occurred due to system failures. The ADS consistently excelled in capturing and accurately predicting all dynamic elements during its operation. More explicitly, Fig. 7\n                         provides the illustration of typical scenarios from each class, and explanations for scenario criticality ranking are provided below.\n                           \n                              •\n                              \n                                 Class I (\n                                 \n                                    \n                                       σ\n                                    \n                                  > 0.70): Critical scenarios for ADS. This class of scenarios has all or nearly all high-contributing features to criticality where the operational status of ADS would be challenged. For example, a scenario where there is a vehicle intentionally changing to the opposite lane on a highway and therefore causing an incident right ahead of the ADS is a Class I scenario. Such scenarios contain features that might trigger irregular boundary conditions for an ADS to reach its limitation.\n                           \n                           \n                              •\n                              \n                                 Class II (0.40 ≤\n                                 \n                                 \n                                    \n                                       σ\n                                    \n                                  ≤ 0.70): General scenarios for ADS operation, excluding scenarios described in Class I and III, where the ADS would rarely encounter maneuver challenges. The scenarios under this class consist of daily life cases, and they are defined by various traffic and weather conditions, the existence of less-conflicting interactions between road users, etc. Typical scenarios may include reacting to common lane-changing, e.g., interacting with a cut-in vehicle which can be observed frequently on multi-lane roads.\n                           \n                           \n                              •\n                              \n                                 Class III (\n                                 \n                                    \n                                       σ\n                                    \n                                  < 0.40): Conservative scenarios for ADS. Simplified scenarios where the safety of ADS is completely ensured. Conditions defined by the features of contributing factors are mostly ideal under this class, and there exist non-perception-impacted conditions and non-conflicting interactions between road users. For example, a common scenario might involve an AV operating at free-flow speed, encountering minimal traffic and navigating through a range of weather conditions.\n                           \n                        \n                     ", "subsubsections": []}, {"label": "3.2", "title": "Human-in-the-loop experiment setup", "text": "", "subsubsections": [{"label": "3.2.1", "title": "Determination of sample size and composition", "text": "The ultimate goal of conducting human-involved experiments was to validate the quantified scenario criticality from human perspectives during ADS operation within the ODD. Essentially, a comparative study was designed to reveal the difference regarding the criticality perception between participants and the fine-tuned ADS. A sufficient range of sampled scenarios needed to be covered by human participants. Based on the descriptive statistics (i.e., the numerical results of classification obtained from the enumerated investigation) in relation to the scenario criticality, a stratified sampling approach was employed with a 95 % confidence level to determine the ideal sample size for human-in-the-loop analysis. Explicitly, we established an optimal sample size of 300 to maintain homogeneity within the sub-scenario groups, while allowing for a marginal error of 5 %. This indicates that a representative fraction of the overall investigated scenarios (Table 1) could be guaranteed by a random selection of at least 300 scenarios from each class. To cover the 300 potential scenarios under each scenario class in human-in-the-loop analysis, a sufficient number of participants was expected. In addition to the calculated scenario combinations, the sample diversity needed to be reflected in several critical attributes listed below:\n                              \n                                 •\n                                 The presence of scenarios following different orders, including 6 combinations. For example, I → II → III, I → III → II, II → I → III, II → III → I, III → I → II, III → II → I.\n                              \n                              \n                                 •\n                                 The impact of genders on people’s perceptions and reactions regarding the defined scenario criticality.\n                              \n                              \n                                 •\n                                 The age of targeting participants should reflect the general population distribution, especially driver distribution within a community (i.e., Melbourne, Australia in this case).\n                              \n                              \n                                 •\n                                 A variety of driving experiences should be considered as the ADS performance could be directly validated from drivers’ (especially experienced) perspectives, and the drivers’ acceptance of autonomous driving plays a key role in the large-scale adoption of AV implementation (Choi and Ji, 2015).\n                              \n                              \n                                 •\n                                 The diverse VR experience should also be included concerning the practical limitations of the delivery of the study. The usage exposure and experience of VR technology might cause the possible influence of tool familiarity, thereby affecting the validity of results (Zou et al., 2021).\n                              \n                           \n                         Considering both the sample size and sample composition, an alternative sampling strategy was determined, involving the recruitment of 60 participants with diverse driving experience. This strategy allowed for the coverage of a total of 300 scenarios within each scenario class, with each individual participant completing 5 scenarios. To achieve this, we implemented a random number function (RAND) capable of selecting values within the ranges of [0, 0.40), [0.40, 0.70], and (0.70, 1), aligning with the quantified scenario criticality. Fig. 8\n                            demonstrates the scenario allocations and potential variables of interest for human-in-the-loop analysis. Statistically, the Friedman test with a significance level of the p-value less than 0.05 was used to assess the comparison results."}, {"label": "3.2.2", "title": "Participants and apparatus", "text": "According to the ideal sample determination, a total of 60 participants (38 males and 22 females) aged from 17 to 48 (Mean = 30.78, SD = 6.97) were recruited. Of the participants, 15 had no driving license, and 15 held provisional licenses with less than two years of unsupervised driving, while the remaining 30 possessed full licenses reflecting 1 to over 20 years of unsupervised driving experience. In addition to the different levels of driving experience, a relatively broad range of VR experiences could also be reflected based on such a sample composition. All participants were recruited through advertisement, and they participated voluntarily. The ethics committee of Monash University approved the study. The detailed demographic information is summarized in Table 3\n                           . The experiment was carried out using a driving simulator SIMREX CDS manufactured by Innosimulation of Seoul, South Korea. In Fig. 9\n                           , a participant is depicted, seated in a simulated cabin equipped with a steering wheel, dashboard, brake and accelerator pedals, and a gear shifter. The simulator features a vibration system that replicates the sensations of natural vehicle motion in response to the contact between the vehicle and the environment. During the experiment, participants wore the HTC VIVE Pro goggles to immerse themselves in a high-quality virtual environment. This equipment has been validated for use in VR studies by Le Chénéchal and Chatel-Goldman (2018), attesting to its suitability for delivering reliable and immersive experiences. Such a setup enabled realistic driving tasks such as performing 180-degree head checks, which are impossible using screen-based simulators. A built-in desktop supported the simulation with an NVIDIA RTX 3090 graphics card, which enhanced the smoothness of the simulating and rendering processes. Furthermore, each participant had a heart rate (HR) monitor designed for specific indoor activities attached to their arms to measure variations in HR throughout the experiment."}, {"label": "3.2.3", "title": "Test procedures", "text": "Before the experiment commenced, participants were organized into six groups, each with 10 individuals of varied attributes. Individual participants received a unique ID for anonymity. A different sequence of scenario selections was applied. For example, participants in Group (1) began with scenarios from Class I, whereas Group (6) started with those from Class III. Grouping details are provided in Table 4\n                           . During the experiment tasks, participants were able to switch off the autopilot mode and take vehicle control by either stepping on the brake pedal or turning the steering wheel if they thought it was necessary. The autopilot would reactivate if participants did not perform any driving actions for three consecutive seconds. For individual participants, the execution of the experiment had the following procedures. (1) Collect demographic data, assess the baseline sickness level using the Simulation Sickness Questionnaire (SSQ as described by Kennedy et al., 1993), and record the heart rate for 3 min as the participant sits in a calm state. (2) Provide a 3-min training session to familiarize the participant with the simulator’s operational mechanism. (3) Generate a value for \n                              \n                                 σ\n                              \n                            five times randomly from the designated class based on the group number. (4) Conduct the simulation experiment tasks under the selected scenarios sequentially, with a period of 5 min in each scenario. (5) After each task, conduct the SSQ survey to measure simulator sickness. (6) Administer subjective questionnaires to assess participants’ general acceptance of the simulator and their self-awareness regarding their behaviors. Each participant was required to complete three sessions to finish the experiment, and the duration of each session was approximately 35–45 min, including questionnaire surveys and breaks. Fig. 10\n                            offers a comprehensive overview of the test procedures, arranged in accordance with the timeline for each testing session. In total, every participant needed to finish 15 driving scenarios, with 5 from each scenario class. The experiment was conducted in a group-by-group and session-by-section form. For example, it started from group (1) session 1 (i.e., selection from Class I scenarios) and ended with group (6) session 3 (i.e., selection from Class I scenarios). Regarding the overall duration of the experiment, each group took one to two days for each session. This meant an individual participant had a buffer period of at least one week between sessions to mitigate the impacts of operational familiarity and potential side effects such as 3D motion sickness and fatigue. VR-enabled studies are known for 3D motion sickness (Kim et al., 2018). To ensure this simulator-induced sickness would not affect behavioral results, we took actions such as technical solutions and pre- and post-experiment surveys to control and measure the impact. From a technical standpoint, we have optimized the simulation to run at a minimum frame rate of 90fps to ensure the smooth rendering of dynamic effects. To further enhance image and motion stability, we employed a high-performance graphics card along with a virtual reality device featuring a high refresh rate. From a design perspective, we intentionally incorporated ample time intervals between tasks. This measure was taken to mitigate and alleviate any symptoms of 3D motion sickness that participants might experience, allowing for recuperation during breaks. Additionally, the participants were instructed that they could terminate the experiment if feeling exceedingly uncomfortable."}, {"label": "3.2.4", "title": "Data collection", "text": "This study collected data from both objective and subjective perspectives during the experiment. In terms of objective data, we measured the intention to intervene, the actual execution of the intervention, and the participants’ average heart rates (AHR). According to the rudimentary theory-based measurement of intention (Feldman and Lynch, 1988), the intervention behavior during autonomous driving can be defined as reasoned action, which is under the control of behavioral intention. The intention of intervention could be measured clearly based on qualitative observation of the participants. In this case, the intention was measured according to participants’ tendentious action to perform the intervention. Meanwhile, the actual intervention behavior and the associated vehicle status (e.g., speed, acceleration, moving direction, etc.) at the moment of intervention, were recorded directly by the simulation platform and could be readily extracted. Heart-rate variations, as measured in this study, were considered a reliable indicator of workload during the interaction with ADS. Research has demonstrated that fluctuations in individuals’ heart rates can be considered a direct and reliable indicator of mental stress (Taelman et al., 2009). Such an indicator has been widely applied in the transportation field for behavior analysis and transport modelling concerning drivers’ mental stress and workload, especially in simulation studies (Zhao et al., 2015; Castro et al., 2020; Xu et al., 2021b; Zangi et al., 2022). Table 5\n                            gives the details of data collection measurements during the experiment. Regarding the subjective data collected using questionnaire surveys, there were four questionnaires utilized in this study: the Demographic Questionnaire, the Simulation Sickness Questionnaire (SSQ) as developed by Kennedy et al. (1993), the Simulation Realism Questionnaire crafted in accordance with guidelines set forth by Van Der Laan et al. (1997), and a Self-awareness Questionnaire adapted from the talk-aloud protocols established by Afflerbach (2001). The Demographic Questionnaire was used for general information about the participants and was filled before the experiment started; SSQ is a checklist containing 16 symptoms such as nausea, fatigue, headache, eyestrain, burp, vertigo, etc., and the assessment is based on a four-point scale format (i.e., from none (0) to severe (3)), which was used to eliminate the side-effects due to VR experiment; the Realism Questionnaire was designed for revealing the user acceptance about the simulation platform. Participants could provide feedback on the intuitiveness of controls, navigation, and other aspects of the platform interface; the Self-awareness Questionnaire was employed to understand how participants perceive, think, and make decisions while interacting with the ADS in the simulation. It enabled participants to describe their behavior, rather than explain it, thereby facilitating the assessment of participants’ intuitive responses during the experiment. Table 6\n                            provides detailed questionnaire contents."}]}]}, {"label": "4", "title": "Comparative results and analysis", "text": "The experiment results are analyzed in this section. The comparative results on criticality perception between participants and the ADS offers insights into the acceptance of AV technology and how people adapt behaviourally during autonomous driving.", "subsections": [{"label": "4.1", "title": "Rider’s intervention behavior and consequences", "text": "“Intervention” actions, i.e., interruption of the ADS operation performed by participants, were recorded during the experiment. Overall, interventions occurred in all scenario classes, with the counted numbers of 462, 774, and 359 in Class I, II, and III, respectively. The detailed distributions of the recorded interventions in all criticality classes are plotted in Fig. 11\n                        (a). Noticeably, there is no apparent correlation between scenario criticality and the frequency of intervention identified. For example, a larger value of scenario criticality did not contribute to more interventions. Participants tended to intervene in the ADS operation much more actively under Class II scenarios. Over 70 % of participants intervened at least twice in each experimental task, with 10 % of them intervening four times. Although less intervention occurred in Class III scenarios compared to the results in Class I scenarios, a similar distribution pattern was found for riders’ intervention behavior. This is evident in the adaptation (i.e., non-intervention) of approximately half the participants when the ADS functioned in scenarios from these two classes. The intervention behavior during autonomous driving was a deliberate action based on intention. Fig. 11(b) displays the observed intentions vs. executions with respect to the intervention. The observed results indicate that as the scenario criticality increases, people tend to feel uneasy, prompting them to consider intervening in the ADS operation. Nevertheless, from the execution perspective, riders might be more likely to trust the ADS operation under highly critical scenarios. Evidently, the intention of intervention did not eventually contribute to an execution. Throughout the experiment, 73.3 % of participants (44) indicated an intention to intervene when the ADS operated in Class I scenarios, with strong intention shown from 24 participants. 66.7 % of participants (40) intended to intervene in the ADS operation in Class II scenarios, of which 7 showed a strong intention. Only 46.7 % of participants (28) had the intention to perform the intervention behavior while the ADS was operating in Class III scenarios, with no strong intentions exhibited. The results in the execution of interventions showed a different pattern, with 21, 33, and 15 participants actually performing interventions in scenarios from Class I, II, and III, respectively. Table 7\n                         summarizes the observed intentions and executions of individual participants’ intervention behavior during the study. Furthermore, the distribution of accumulated interventions under three scenario categories during the 5-minute testing interval is shown in Fig. 11(c). Similar trends in participants’ intervention behavior were observed when the ADS operated under Class I and III scenarios. This was evident in the concentrated frequency of interventions occurring between 100 and 250 s, which typically fell in the middle of a single experimental task. These patterns suggest that participants were able to adapt to the operational mechanism of the ADS within the time frame of individual driving scenarios categorized under Class I and III. In contrast, interventions were recorded consistently throughout the operation of the ADS under Class II scenarios, indicating that participants found it challenging to adapt to the ADS’s operational mechanism under those specific conditions. The resulting degree of intervention came unexpectedly. The embedded ODD guaranteed the ADS performance with an accident rate as low as less than 10 % (Fig. 4), so accidents may happen in less than 10 scenarios out of 100. Nevertheless, interventions were recorded 1,595 times across all scenario classes, out of a total of 900 test scenarios. This indicates that even when participants perceived hazardous conditions, those conditions did not necessarily evolve into accidents. Consequently, at least 1,500 of these interventions could be considered unnecessary. The motivation of such interruptions should be understood and avoided, otherwise they affect the efficiency of ADS (e.g., extra travel time due to decelerations and re-accelerations) and road safety (e.g., creating conflicting areas due to the induced actions of the vehicles behind or adjacent). More specifically, the riders’ intervention behavior demonstrably had adverse impacts on both road safety and traffic efficiency during the course of the experiment. In Fig. 12\n                        , representative examples of interventions that occurred in each scenario class are depicted in sub-figures a1, a2, and a3. While these decisions may have been motivated by safety considerations, abrupt changes in the ADS operational status inadvertently “created” traffic conflicts with adjacent vehicles, thereby causing accidents as illustrated in Fig. 12(a1) & (a2). Additionally, these interventions resulted in unnecessary speed reductions that extended overall travel time, a trend that was equally applicable to Class III scenarios as shown in Fig. 12(a3). In Fig. 12(b), comparative data on accident rates, absolute accelerations, and average waiting time between intervened and non-intervened cases are presented across different scenario classes. It is worth noting that the ADS operated smoothly and efficiently in all selected scenarios with the accident rate of less than 0.1. However, riders’ intervention behavior disrupted this optimal state. For instance, rider-initiated braking led to a substantial increase (i.e., approximately 150 %) in absolute acceleration, with the value rising from 2.67 to 6.72 m/s2 (Fig. 12(b2)). Consequently, this type of behavior exacerbated conflict zones, as evidenced by the rise in the accident rate to over 0.3 (notably under Class II scenarios) (Fig. 12(b1)), and also extended the average waiting time by 64.3 % (Fig. 12(b3)).", "subsubsections": []}, {"label": "4.2", "title": "Causes of the intervention behavior", "text": "", "subsubsections": [{"label": "4.2.1", "title": "Impacts due to perception difference", "text": "Fundamentally, revealing the differences in perception of critical between ADS and humans is crucial to understanding the motivation of riders’ intervention behavior. When revisiting the variables outlined in Fig. 6, which relate to the criticality of scenarios concerning ADS operation, a subtle discrepancy was observed in how participants weighted the importance of these variables, as the majority of interventions occurred in Class II scenarios. Fig. 13\n                            presents an overview of the participants’ intervention behavior for further understanding the rationale behind. Upon segmenting the quantified scenario classes into five intervals, the majority of interventions occurred within the range of [0.59, 0.72] (a subset of [0.40, 0.80)), which corresponds to Class I and II scenarios (Fig. 13(a)). In these cases, the ADS might interact with various road users at relatively high speeds (60–100 km/h) under various weather and traffic conditions. To gain insight into the motivations behind interventions from the safety perspective, the aggregated results regarding traffic conflict probability is illustrated in Fig. 13(b). A conflict probability falling within the range of (0.60, 0.70) is observed, which can be attributed to the specific characteristics of scenarios with the criticality of [0.40, 0.80). Furthermore, according to the results of the statistical assessment, no significant differences were observed in intervention behavior among the assigned experimental groups with regard to the order in which scenarios were presented. Instead, significant interactions were identified between various factors, namely vehicle speed (P = 0.014), traffic flow (P = 0.019), road disruption (P = 0.021), and vehicular interaction (P = 0.011), and participants’ intervention behavior. As depicted in Fig. 13(c), the probability of intervention did not exhibit a positive correlation with those factors. Instead, interventions were most likely to occur within specific ranges that are closely related to the observed scenario criticality range. Note that the probability of intervention was converted based on the execution instead of the intention. The performance of ADS is a fine-tuned result of the reinforcement learning, which defines a critical scenario strictly based on physics and calculations. In contrast, humans define a critical scenario by observation and a measure of risk or challenge, not only less quantitative but heterogeneous among situations. In the cases where participants intervened most frequently (\n                              \n                                 σ\n                                 ∈\n                                 [\n                                 0.59\n                                 ,\n                                 0.72\n                                 ]\n                              \n                           ), they tended to perform maneuvers such as stopping or turning urgently before the ADS acted. An illustrative example is shown in Fig. 14\n                           (a), where the ADS was facing an inappropriate cut-in merging under high flow conditions on a six-lane major arterial road where the average travelling speed is 69 km/h. Regarding the decision-making of driving maneuvers, a passenger in the AV is likely to intervene by applying the brakes at an acceleration rate of −4 to −6m/s2 to facilitate the completion of cut-in behavior. This suggests that people generally regard such situations (i.e., \n                              \n                                 σ\n                              \n                            = 0.61) as critical, and would doubt the ADS performance under these circumstances. From the perspective of the ADS, the planned operational trajectory falls within the safety margin based on the estimated vehicle motions under such circumstances. Therefore, the ADS would not consider such scenarios critical, making any passenger-initiated interruptions largely unforeseen by the system. The number of executed interventions became lower when the ADS operating in a rather more critical scenario with \n                              \n                                 σ\n                              \n                            of higher than 0.72. A representative example is illustrated in Fig. 14(b). In this instance, the ADS encountered challenges posed by exceptional pedestrian behavior while operating at 21 km/h on a two-lane urban arterial road, further complicated by rain and fog conditions in a high-flow traffic environment. It can be clearly perceived that pedestrians were suddenly running into the ADS’s planned trajectory within a relatively short distance of 5 m. Nevertheless, the executions of intervention behavior were seldom observed in such situational contexts (i.e., \n                              \n                                 σ\n                              \n                            = 0.82). The ADS would typically respond more swiftly by initiating automatic emergency braking (AEB) to ensure a safe stop. Consequently, passengers would be more likely to trust the decision-making capabilities of the ADS under such circumstances. Furthermore, riders’ decision-making on intervention was found to be affected by their cognitions of driving (P = 0.043), especially during the operation under Class II scenarios. In Fig. 14(c), the graph illustrates the percentages of interventions carried out by participants, categorized by their respective levels of driving experience, across the segmented scenario classes. Of the 1595 executed interventions, a mere 7 % were conducted by individuals who were not drivers. As reflected in the plotted distribution, most interventions were undertaken by participants with 6 to 10 years of driving experience. They were closely followed by drivers with 1 to 5 years of experience, who engaged in interventions across all the examined scenarios. As for seasoned drivers with more than 10 years of experience, the bulk of their interventions occurred when the \n                              \n                                 σ\n                              \n                            fell within the range of 0.59 to 0.72. Concerning standardized AV testing scenarios with the minimized effect of randomness in the combination of potential contributing factors (e.g., the deviation in factor importance), the critical scenarios perceived by ADS would be based on a threshold of \n                              \n                                 σ\n                              \n                            equals to 0.72, compared to the value of 0.59 perceived by its human counterparts. As shown in Fig. 14(d), for \n                              \n                                 σ\n                                 ∈\n                              \n                            [0.59, 0.72] would be scenarios that ADS regarded safe for no actions of changing the current operation status, but human riders (especially experienced drivers) considered unsafe and would like to interrupt ADS operation."}, {"label": "4.2.2", "title": "Impacts due to task-induced mental stress and simulation factors", "text": "The difference in the perception of criticality between humans and the ADS explains the occurrence of interventions under Class II scenarios. However, there is a notable decline in the execution of interventions in Class I scenarios, particularly when \n                              \n                                 σ\n                              \n                            falls within the range of 0.8 to 1.0, regardless of the differences in ordering effects, age, gender, driving experience, and VR experience. To gain deeper insights into the underlying motivations for interventions, we analyzed the effects of participants’ workload as well as various simulation factors on their intervention performance. As mentioned in subsection 3.2, participants’ average heart rates (AHR) were monitored both before and during the experiment. This served as an indicator of mental stress, providing insights into the motivation of interventions in this study. In Fig. 15\n                           , the graph illustrates the comparative results in participants’ AHR between cases involving intervention and those without, across various scenarios. Relative to the baseline AHR of 82 beats per minute (bpm), an upward trend was observed during the VR experiment. We observed a consistent upward trend in AHR as scenario criticality increased. In particular, the maximum increases in AHR were found to be 7.3 %, 36.4 %, and 42.6 % for Class III, II, and I scenarios, respectively. In most of scenarios from Class III and II, particularly where \n                              \n                                 σ\n                              \n                            falls within the range of [0.00 0.60), there was an observed increase in AHR ranging from 2.4 % to 14.4 % in cases involving interventions compared to those without. This phenomenon indicates that within a specific range of quantified scenarios, not only does mental stress increase in alignment with rising levels of scenario criticality, but individuals who engage in intervention behavior also exhibit higher levels of mental stress compared to those who do not intervene. Distinct variations in participants’ AHR were observed when the \n                              \n                                 σ\n                              \n                            fell within the range of [0.60, 0.80). Specifically, participants who opted to execute interventions had an AHR that was 1.8 % lower than those who adhered to the decisions made by the ADS. A representative scenario featuring a \n                              \n                                 σ\n                              \n                            of 0.61 is depicted in Fig. 15. In this scenario, the ADS is approaching a signalized intersection at a speed of 13 km/h while simultaneously interacting with both a cyclist and a preceding vehicle under sunset condition (i.e., dazzling light). Such a situational context, namely the proximity between the ADS and these other road users, may have contributed to discomfort for the passenger inside the ADS, as evidenced by an elevated AHR compared to the baseline. This discomfort could potentially lead to intervention behavior such as harsh braking or even a full stop. By performing such actions, participants were likely to alleviate their mental stress to some extent. Moreover, when the scenario reached its highest level of criticality, falling within the [0.80, 1.00), the difference in AHR variations between intervention and non-intervention cases was marginal, at approximately 0.1 %. The peak AHR was recorded during the ADS operation in scenarios that fell within this specific range of criticality. Another typical scenario featuring a \n                              \n                                 σ\n                              \n                            of 0.80 is also illustrated in Fig. 15. In this particular instance, the ADS is navigating on a freeway where the average flow speed decreases from 78 km/h to 60 km/h, impacted by a mainstream disruption (i.e., the work zone), under conditions of rain, heavy fog, and high traffic flow. The contextual complexity of the situation is amplified by two vehicles overtaking the ADS: one cutting in from the right at a speed of 71 km/h, and another on its left traveling at 75 km/h. In such a situational context, participants tended to be extremely stressed as reflected in their AHR, but few of them would perform intervention behavior eventually. Statistical analysis revealed a significant influence of scenario criticality on participants’ AHR (P = 0.049), regardless of the impacts of gender, age, the order in which scenarios were presented, and prior VR experience. Additionally, there was a notable difference in the fluctuations of participants’ AHR when factoring in driving cognitions (P = 0.047). Among non-drivers, the increase in AHR remained relatively stable throughout the experiment, varying only between 2.0 % and 3.0 %. As mentioned in subsection 3.2, simulation factors could also have an influence on participants’ behavioral outcomes. Fig. 16\n                            summarizes the SSQ results in this study. Overall, participants nominated 10 out of 16 symptoms after completing the experiment. Most of these nominated symptoms were of slight intensity, with only a few cases reported as moderate. The prevailing symptoms were vertigo, dizziness, and nausea. Statistical analysis revealed significant interactions between the VR experiment and symptoms of vertigo (P = 0.031), dizziness (P = 0.034), and nausea (P = 0.044). In addition, a positive correlation was identified between scenario criticality and the number of participants who experienced simulation sickness. For example, Class I scenarios were more likely to induce simulation sickness, as evidenced by the highest number of slight- and moderate-level symptoms reported by participants after completing the experiments. Specifically, 41 participants (68.3 %), 23 participants (38.3 %), and 22 participants (36.7 %) reported symptoms of vertigo, dizziness with eyes closed, and dizziness with eyes open, respectively. Among these, eight participants experienced a moderate level of sickness. Similar patterns in simulation sickness outcomes for Class II and Class III scenarios are depicted in Fig. 16 (c) and (d). These charts show a reduced number of participants experiencing symptoms in these classes compared to the other. Nevertheless, the designed VR experiment did not result in any cases of severe-level sickness. Our study lends empirical support to the emerging trend of increased comfort and familiarity with VR technology, as compared to VR-enabled studies from previous years (Sportillo et al., 2018; Xu et al., 2021a). In our study, all 900 test scenarios were flawlessly carried out by our diverse group of 60 participants, with no reported cases of severe motion sickness. Furthermore, participants evaluated the simulation platform and their performance by conducting definitive surveys that follows a Likert seven-point scale form. The detailed results are listed in Table 8\n                           . With respect to the simulator realism, the delivery of our work was adequately appreciated. For example, the results demonstrated that over 77 % (18 % strongly agreed, 24 % agreed, and 35 % somewhat agreed) of participants agreed that the simulation platform provides a decent environment (e.g., 3D visualization and great realism). Over 83 % (21 % strongly agreed, 35 % agreed, and 27 % somewhat agreed) of participants agreed that the simulation of ADS is reliable and futuristic, showing a high acceptance. While the scores related to the presented AV functionality and interactions were on the lower side, the average scores for all categories exceeded a value of 5. Statistically, the Cronbach’s α value of 0.76 was obtained, indicating an acceptable internal consistency of participants’ appreciation. Regarding their behavioral outcomes, all participants agreed that their intervention behavior was performed intentionally and not affected due to simulation factors, with the average scores of 5.68 and 5.83, respectively. Interestingly, participants’ subjective assessments of their mental stress revealed that ADS operation under Class II scenarios posed the greatest mental strain, followed by Class I and then Class III scenarios. This is contradicted with the observed data on participants’ AHR, as shown in Fig. 15. Another noteworthy insight from the subjective survey revealed that participants expressed the highest level of trust in the ADS when operating under Class I scenarios, with the mean score of 4.15. Statistically, the Cronbach’s α value of 0.73 was achieved, suggesting an acceptable internal consistency of participants’ subjective responses."}]}]}, {"label": "5", "title": "Discussion", "text": "In this study, we assumed a mixed-traffic environment with a fine-tuned Level 4 ADS, and quantified the critical scenarios during the DDTs from the perspective of the ADS. Simulation often acts as the foundational step for validating conceptual theories. The simulation activities carried out in this study contributed to greater transparency in AV technology, offering predictive insights into future scenarios involving high-level ADS in traffic environments. For high-level ADS that are fully supported by sensing capabilities, the ODD boundaries are more likely to be induced due to road users’ exceptional behavior, rather than specific environmental constraints such as precipitation, lighting, or high travel speeds. Thus, passengers in such a high-automation vehicle are generally expected to acclimate to the vehicle’s operational mechanisms for most of the time, resuming manual control only under special conditions where the ADS reaches its operational limits. Nonetheless, the observed behavior of participants when they acted as passengers deviated from this expectation, exhibiting different patterns of interaction with the vehicle. The results from Section 4 reflect riders’ attitudes toward high-level autonomous driving, providing valuable empirical insights into the potential improvements in ADS technology to facilitate user adoption. Regarding the riders’ behavioral adaptation while interacting with the ADS, it was found that human, especially those with driving experiences, perceived critical scenarios have a lower criticality value compared to the ADS perception. The majority of interventions were carried out by experienced drivers and took place under Class II scenarios, which are general scenarios as perceived by the ADS. Notably, most of these interventions were found to be unnecessary and could potentially lead to unexpected consequences, as illustrated in Fig. 12. Referring to participants’ reactions (Fig. 11 & Fig. 13) and mental stress (Fig. 15) during such scenarios, the main reasons for the distrust could be either the feeling of inconsistent decision-making between themselves (as drivers) and the ADS, or the simple refusal to accept the ADS under specific risky scenarios as they perceived. This finding implies that performance of the ADS in scenarios that are most familiar to drivers—specifically, Class II as defined in this study—may require additional scrutiny to foster greater acceptance and adoption among the driving population. If the ADS makes human-like decisions when facing these scenarios, it will possibly improve the experience of riders to reduce intention and action of interventions. Nevertheless, this does not mean that the ADS should be entirely human-centric, as the intelligent transport system relies on the advanced features of the ADS to ensure safety and intelligent drives. As discussed in previous literature (Frank et al., 2019; Gill, 2020; DeGuzman and Donmez, 2021; Li et al., 2021), human decisions cannot always be right and appropriate, and it might also increase the moral dilemmas between people and AI. Therefore, it is vitally important for future ADS to consider and make trade-offs with the human perspectives. Integrating an intelligent voice notification system to alert passengers in such scenarios could be a viable alternative to enhance both safety and user experience. Human behavior is inherently complex and unpredictable. Our study revealed an intriguing trend: while the intention to intervene was highest among participants when facing high-criticality scenarios (with a criticality value exceeding 0.72, as defined by Class I scenarios in this study), the actual execution of interventions decreased under these conditions, as illustrated in Fig. 11. This finding implies that individuals are more likely to relinquish decision-making authority to the ADS when they perceive situations as too complex or beyond their capacity to manage effectively, even though their AHR could be physiologically increased due to the stimulus involved in such scenarios. This is further supported by the results in Fig. 13(c) and the evidence in Fig. 14(b) and Fig. 15, where the probability of intervention—converted by actual interventions—demonstrated a downward trend as situational complexity increased. This complexity encompassed factors such as higher speeds, increased traffic flow, road disruptions, and more intricate vehicular interactions. Based on the subjective evaluations results, participants indicated a greater appreciation for the operation of the ADS under Class I scenarios. This aligns with previous research by Bonnefon et al. (2016) and Morita and Managi (2020), which suggests that people are more willing to accept AVs if they can effectively navigate complex driving scenarios. Furthermore, the obtained results showed that interventions increase with driving cognition (Fig. 14). This indicates that non-drivers or less-experienced drivers are more likely to trust more on ADS operation under all scenarios. This is consistent with the findings in previous studies on the so-called “first-time” use of AV technology and the role of riders in AV adoption (Becker and Axhausen, 2017; Paddeu et al., 2020; Weschke et al., 2021). As pointed out by Fransson (2006) that people’s intrinsic modes in relation to driving are unconscious and considered a default mode of brain function once they grasp the basic skills. This means that if people regard themselves as “drivers” and start to review the performance of ADS, they will tend to take action. The question then is when and how the riders allocate themselves as drivers. Investigating this question would be very useful to understand the appreciation and trust towards ADS under various scenarios. However, this would require insightful and large-scale behavioral studies, given that human behavior is highly heterogeneous and there might be reasons beyond the criticality of the scenarios that might cause interventions. One potential solution to improve acceptance, comfort, and safety at the same time is through the personalization of ADS, which was argued in the literature (Kalra, 2017; Chen et al., 2022; Zhang et al., 2022). CARLA as an AV simulation tool has been utilized for case-specified studies regarding both theoretical and empirical analyses (Araluce et al., 2022; Shi et al., 2022). The integrated simulation strategy introduced in this study adds a layer of transparency to the development of AVs. It offers an alternative methodology for collecting data across a wide variety of driving scenarios, while also facilitating a more nuanced behavioral analysis. The lack of traffic details is a commonly recognized limitation of driving simulator studies (Wynne et al., 2019). Our proposed methodology enables the replication of realistic traffic dynamics, thereby enhancing the stochastic nature of the simulated environment. This enhancement in the randomness of the simulation ensures that the results are obtained from an environment that more closely approximates real-world conditions. The flexibility of scenario generation proposed in this work can be a complementary of existing simulation tools to policymakers, automobile manufacturers, and researchers in automation fields for the validation of theoretical systems, futuristic hypotheses, or empirical analyses. Three objective limitations in this study deserve research follow-ups. Firstly, more extensive empirical experiments shall be carried out on the critical scenarios with respect to driver demographics. While this is beyond the scope of this work, we are interested in validating our findings with more samples. Secondly, the average heart rate was measured as the indicator of rider’s mental stress. Considering that stress originates from psychological factors and that an individual’s AHR can vary due to a multitude of complex determinants, it is important to acknowledge that such an indicator may introduce bias. However, AHR was only considered an auxiliary indicator to link the performance of participants with their status, and no significant impact of such an indicator on the interpretation of results was found. Additional instruments like electroencephalograms (EEG) or eye-tracking systems, which offer detailed measurements of brain activity and visual perception, could be employed to further quantify the mental stress experienced by riders while inside an AV. Moreover, the intention of intervention was measured based purely on the observation, and the analysis was done statistically. Relying on the psychological strategy to understand the motivation of riders’ intervention behavior during ADS operation might provide more profound insights in relation to the rider’s behavioral adaptation. Our paper forms a part of ongoing research on the interaction between humans and high-level ADS, which promotes interplanetary research and will shed light on the facilitation of user adoption of AV technology. Based upon the findings from this work, prevention strategies specifically for intervention behavior under safe ADS operational circumstances could be developed, thereby expediting public acceptance of AV technologies.", "subsections": []}, {"label": "6", "title": "Conclusion", "text": "The question of whether to place full trust in a validated ADS is crucial for gaining deeper insights into user adoption patterns concerning AV technologies. This paper provided a comprehensive summary of the factors that influence the safety performance of the ADS, while also exploring how riders adapt behaviourally to the operation of high-level ADS across a range of scenarios. Leveraging innovative simulation strategies, we introduced a quantifiable method for scenario criticality to standardize various situations involving high-level ADS in mixed-traffic environments and further transparentized the AV technology. Furthermore, we identified specific scenarios where riders are likely, or unlikely, to engage in intervention behavior via the human-in-the-loop analysis. While fewer interventions were captured under Class I scenarios, such extreme conditions (Class I scenarios) are seldom encountered in daily life compared to Class II scenarios. It is under these more common conditions (Class II) that the majority of interventions are initiated by experienced drivers. This presents a significant obstacle to the widespread implementation of AVs. The important findings are (1) an extremely low accident rate could be achieved when ADS is operating within its ODD. Within this domain, the primary factors influencing the boundaries are often the exceptional behaviors exhibited by other road users; (2) a strong intention to intervene does not necessarily translate into actual intervention behavior, and the majority of interventions are unnecessary and could exacerbate conflicts on the road, thereby increasing the potential for hazards; (3) experienced drivers are more likely to rely on their own skills when the ADS operates in scenarios with which they are familiar. Conversely, they are more inclined to trust the ADS when it handles situations that exceed their own capabilities to control effectively; (4) non-drivers are less inclined to engage in intervention behavior during the operation of the ADS, as they are more likely to perceive themselves as passengers rather than drivers. In conclusion, main contributions of our work to the existing literature are in the following aspects:\n                        \n                           •\n                           Leveraging the innovative features of a highly reputable, VR-enabled simulation platform, we conduct both theoretical and empirical analyses to evaluate the performance of ADS under diverse conditions. This robust approach allows us not only to quantify the criticality of different scenarios but also to examine human behavioral adaptations during interactions with autonomous vehicles.\n                        \n                        \n                           •\n                           Isolating scenarios that pose maneuvering challenges for both human drivers and ADS. Armed with these insights, we obtained specific intervals where ADS perceive conditions as safe, but human riders consider them hazardous. Such intervals will be subject to rigorous validation in future research endeavors.\n                        \n                        \n                           •\n                           Introducing a standardized set of criteria for evaluating critical driving scenarios within a mixed-traffic context. By utilizing our integrated simulation approach, we successfully replicated a wide array of potential situations in a naturalistic setting and consequently established a comprehensive scenario library.\n                        \n                     \n                  ", "subsections": []}]